## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 0 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.root_integration must be replaced
-/+ resource "aws_api_gateway_integration" "root_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "pzybkj" -> (known after apply)
      ~ http_method             = "GET" -> "ANY" # forces replacement
      ~ id                      = "agi-s50ry4jhg5-pzybkj-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_templates       = {} -> null
      ~ resource_id             = "pzybkj" -> "hm85fkep2e" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.root_integration_response will be created
  + resource "aws_api_gateway_integration_response" "root_integration_response" {
      + http_method        = "ANY"
      + id                 = (known after apply)
      + resource_id        = "hm85fkep2e"
      + response_templates = {
          + "text/html" = ""
        }
      + rest_api_id        = "s50ry4jhg5"
      + status_code        = "200"
    }

  # aws_api_gateway_method.root_method must be replaced
-/+ resource "aws_api_gateway_method" "root_method" {
      - authorization_scopes = [] -> null
      ~ http_method          = "GET" -> "ANY" # forces replacement
      ~ id                   = "agm-s50ry4jhg5-pzybkj-GET" -> (known after apply)
      - request_models       = {} -> null
      ~ resource_id          = "pzybkj" -> "hm85fkep2e" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.api_root_response_200 must be replaced
-/+ resource "aws_api_gateway_method_response" "api_root_response_200" {
      ~ http_method         = "GET" -> "ANY" # forces replacement
      ~ id                  = "agmr-s50ry4jhg5-pzybkj-GET-200" -> (known after apply)
      ~ resource_id         = "pzybkj" -> "hm85fkep2e" # forces replacement
      - response_parameters = {} -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.root will be destroyed
  - resource "aws_api_gateway_resource" "root" {
      - id          = "pzybkj" -> null
      - parent_id   = "hm85fkep2e" -> null
      - path        = "/ANY" -> null
      - path_part   = "ANY" -> null
      - rest_api_id = "s50ry4jhg5" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>